<?php
//3. задание массив с городами
$regions = [];
$regions['Московская область'] = ['Москва', 'Зеленоград', 'Клин', 'Серпухов', 'Королёв'];
$regions['Ленинградская область'] = ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт', 'Пушкин'];
$regions['Рязанская область'] = ['Рязань', 'Пронск', 'Шилово', 'Путятино', 'Спасск-Рязанский'];
foreach ($regions as $oblast => $city){
	echo '<br>' . $oblast . ':' . '<br>';
	foreach ($city as $key => $value)
        {
            echo $value . ', ';
        }
}

echo '<br>';
echo '<br>';
//4. задание Написать функцию транслитерации строк.

function translit($text){
	 $liter = [
		 'а' => 'a', 
		 'б' => 'b', 
		 'в' => 'v', 
		 'г' => 'g',
		 'д' => 'd',
		 'е' => 'e',
		 'ё' => 'yo',
		 'ж' => 'zh',
		 'з' => 'z',
		 'и' => 'i',
		 'й' => 'y',
		 'к' => 'k',
		 'л' => 'l', 
		 'м' => 'm', 
		 'н' => 'n', 
		 'о' => 'o',
		 'п' => 'p',
		 'р' => 'r',
		 'с' => 's',
		 'т' => 't',
		 'у' => 'u',
		 'ф' => 'f',
		 'х' => 'h',
		 'ц' => 'ts', 
		 'ч' => 'tch',
		 'ш' => 'sh',
		 'щ' => 'sch',
		 'ы' => 'y',
		 'э' => 'e', 
		 'ю' => 'yu',
		 'я' => 'ya'];
	 return strtr($text, $liter);//Эта функция возвращает строку str, в которой каждое вхождение любого символа из перечисленных в $text заменено на соответствующий символ из строки $liter.
 }
 
echo translit('Функции обработки строк');

echo '<br>';
echo '<br>';

//5. задание. функция заменяет в строке пробелы на подчеркивания
function replacement($record){
	$blank = [' ' => '_'];
	return strtr($record, $blank);
}
 echo replacement('ку ку ку');
 
 echo '<br>';
 echo '<br>';
 
 //8.вывести на экран только города, начинающиеся с буквы «К» 
 
 $regions = [];
$regions['Московская область'] = ['Москва', 'Зеленоград', 'Клин', 'Серпухов', 'Королёв'];
$regions['Ленинградская область'] = ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт', 'Пушкин'];
$regions['Рязанская область'] = ['Рязань', 'Пронск', 'Шилово', 'Путятино', 'Спасск-Рязанский'];
foreach ($regions as $oblast => $city){
	echo '<br>' . $oblast . ':' . '<br>';
	foreach ($city as $key => $value){
		if ( stristr($value, 'К')) //
		echo $value . ', ';
	}
}
echo '<br>';
 echo '<br>';
//9. 
function transliti($text){
	 $liter = [
		 'а' => 'a', 
		 'б' => 'b', 
		 'в' => 'v', 
		 'г' => 'g',
		 'д' => 'd',
		 'е' => 'e',
		 'ё' => 'yo',
		 'ж' => 'zh',
		 'з' => 'z',
		 'и' => 'i',
		 'й' => 'y',
		 'к' => 'k',
		 'л' => 'l', 
		 'м' => 'm', 
		 'н' => 'n', 
		 'о' => 'o',
		 'п' => 'p',
		 'р' => 'r',
		 'с' => 's',
		 'т' => 't',
		 'у' => 'u',
		 'ф' => 'f',
		 'х' => 'h',
		 'ц' => 'ts', 
		 'ч' => 'tch',
		 'ш' => 'sh',
		 'щ' => 'sch',
		 'ы' => 'y',
		 'э' => 'e', 
		 'ю' => 'yu',
		 'я' => 'ya',
		 ' ' => '_'
		 ];
	 return strtr($text, $liter);
 
echo transliti('Функции обработки строк');
?>